// 모스부호(1)
function solution(letter) {
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
    }
    // morse['.-']는 a입니다, morse['-...']는 b입니다
    letter = letter.split(" "); //letter를 공백별로 배열로 바꿉니다.
    let answer = ''
    // sign이라는 매개변수가 들어오고, sign이라는 매개변수는 '.-', '-...' 이런 모스 부호들이 들어     옵니다. letter 배열에 있는 값들이 하나하나 접근됩니다.
    letter.map(sign => answer+=(morse[sign])); // answer+=(morse['.-']); 반복
    return answer;
}